[
    {"date": "1993","title":"Happy birthday","description":"I was born on September 1st, 1993. As a child I was enthusiastic about exploring every environment I came across."},
    {"date": "1999","title":"First piano lesson","description":"My grandmother was a concert pianist and a piano teacher. I was visiting her one time and she was playing a piece of music that I liked, and I played it bck to her by ear. She insisted I was formally trained and thus I began my first steps in the music world. I loved playing but didn't spend any time practicing, however things turned out well since I was to memorize the progress my teach had me go through each lesson."},
    {"date": "2005","title":"Youngest at John Bryce","description":"I grew up around computers, and whenever my father left his PC unattended I used to sneak and remove hardware pieces, then put them all together before he returned. I was embarrassed when I got caught and my father kept a close eye on his computer nad decided that it is best that I experimented on my own computer. When I turned 12, he had me attend John Bryce, taking a course in software and networks. I was youngest at the the school as it was targeting adults. Our instructor was Roni Ophir, who besides teaching had a musical career and made studying fun."},
    {"date": "2008","title":"Highschool","description":"At highschool I was a part of 'Mofet' program, in which I studied 5 Points of maths, english, physics and computer science in addition to the ore subjects. I finished my studies in the first 3 a year in advance."},
    {"date": "2011","title":"Technion institute of Technology","description":"I graduated with 110 GPA and was accepted to Technion Institution of Technology, majoring in computer science. I had to quit after 4 semester due to a medical condition."},
    {"date": "2014","title":"Rimon school of music","description":"I was looking for a meaningful path and decided to enroll in Rimon school of music. I spent three years learning what I loved most. I took part in competitions (one of which I won 1st price for best arrangement). I was nominated for a CARA award (international acapella competition) for best mixed collegiate arrangement. As a musician I performed across the country and recorded a studio album of my own materials."},
    {"date": "2017","title":"Teaching","description":"As i grew tired of waitering, I was offered to substitute for a sick music teacher and was exposed to a brand new world expertise which i decided to give a try. It was challenging trying to convey musical concepts to non trained musicians. Hence, I learned to adjust myself for my students, practice patience and encourage them to keep on going despite thee difficulty. As my experience as a musical teacher grew, I decided to try my luck as a school music teacher and started teaching Ironi Alef (middle school in Modi'in) pupils at their school's music program. When I moved to TLV, I was accepted a music teach and 1st grade educator, despite having no experience as such. Being a first grade teacher, in addition to giving the rest of the school music lessons was demanding and challenging. I had to take part in helping my kids' practical, emotional and social issues, collaborating with their parents, who often put more challenges. As a teacher, i was inspired by my teachers as a pupil and tried my best to follow their way of teaching. I was the next 5 years."},
    {"date": "2022","title":"Full stack training","description":"It was hard saying goodbye to these children. They went straight to the heart and remained there. We keep in touch now and then. However, aa change was needed and it has been while since I sat on a 'student seat', so I enrolled in Cooding Academy full stack bootcamp. It was intense 3 months of daily learning and coding, day to night. None the less it was an amazing experience that I recommend to anyone with a desire to code."},
    {"date": "2023","title":"Full stack developer","description":"I am currently looking for my next challenge. I come with all of the skills that I have learned, and a desire to do great things!"}
]