[
    {"date": "1993","title":"Happy birthday","description":"I was born on September 1st, 1993. As a child I was enthusiastic about exploring every environment I came across."},
    {"date": "1999","title":"First piano lesson","description":"My grandmother was a concert pianist and a piano teacher. I was visiting her one time and she was playing a piece of music that I liked, and I played it back to her by ear. She insisted I was formally trained and thus I began my first steps in the music world. I loved playing but didn't spend much time practicing, however things turned out well since I was able to memorize the progress my teach had me go through each lesson."},
    {"date": "2005","title":"Youngest at John Bryce","description":"I grew up around computers, and whenever my father left his PC unattended I used to sneak and remove hardware pieces, then put them all together before he returned. I was embarrassed when I got caught and my father kept a close eye on his computer ever since. He also decided that it is best that I experimented on my own computer. When I turned 12, he had me attend John Bryce, taking a course in software and networks. I was youngest at the the school as it was targeting adults. Our instructor was Roni Ophir, who besides teaching had a musical career and made studying fun."},
    {"date": "2008","title":"Highschool","description":"At highschool I was a part of 'Mofet' program, in which I studied 5 Points of maths, english, physics and computer science in addition to the core subjects. I finished my studies in the first 3 a year in advance. Looking back, my desire to teach was reflected back then. I was giving free private lessons to classmates in math and c# at my teacher's request."},
    {"date": "2011","title":"Technion institute of Technology","description":"I graduated with 110 GPA and was accepted to Technion Institution of Technology, majoring in computer science. I was 18 at the time, and had completed four semesters."},
    {"date": "2014","title":"Rimon school of music","description":"I was looking for a meaningful path and decided to enroll in Rimon school of music. I spent three years learning what I loved most. I took part in competitions (one of which I won 1st prize for best arrangement). I was nominated for a CARA award (international A capella competition) for best mixed collegiate arrangement. As a musician I performed across the country and recorded a studio album of my own materials."},
    {"date": "2017","title":"Teaching music","description":"As I grew tired of waitering, I was offered to substitute for a sick music teacher and was exposed to a brand new world of expertise which I decided to give a try. It was challenging trying to convey musical concepts to non trained musicians. Hence, I learned to adjust myself for my students, practice patience and encourage them to keep on going despite the difficulty. As my experience as a musical teacher grew, I decided to try my luck as a school music teacher and started teaching Ironi Alef (middle school in Modi'in) pupils at their school's music program."},
    {"date": "2019","title":"School teacher","description":"When I moved to TLV, I was accepted a music teacher and 1st grade educator, despite having no experience. I was juggling between educating, giving lessons in math and hebrew while giving music lessons to the rest of the school (15 class in total). Besides teaching I had to support my kids' practical, emotional and social needs. When I encountered problems, I had to report to the school principal and the child's parents. Parents occasionally didn't see eye to eye as the school values to say the least, so I had to supply demands for both sides. At the end of the year both the parents and the school staff were thankful for me doing my best and keeping it cool. I felt so grateful for my teachers when I was a pupil. Without meaning to, they taught me how to teach and handle conflicts in a constructive way. I was lucky to also have wonderful colleagues to look up to. I was a teacher for the next 3 years."},
    {"date": "2022","title":"Full stack training","description":"It was hard saying goodbye to these children. They went straight to the heart and remained there. We keep in touch now and then. However, a change was needed and it has been while since I sat on a 'student seat', while looking at one daily for 5 years from the teacher's point of view. I enrolled in Coding Academy full stack bootcamp. It was intense 3 months of daily studying and coding, day to night. Nonetheless, it was an amazing experience that I recommend anyone with a desire to code."},
    {"date": "2023","title":"Full stack developer","description":"I am currently looking for my next endeavour. I come with all of the skills that I have acquired, and a desire to do great things!"}
]